// 4. 연산자 (비트, 삼항)

#include <stdio.h>

int main(){

    // 비트 논리 연산자
    int a = 8, b = 10; // 0000 1000, 0000 1010
    printf("%d\n", a & b); // 8 (0000 1000)
    printf("%d\n", a | b); // 10 (0000 1010)
    printf("%d\n", a ^ b); // 2 (0000 0010)
    printf("%d\n", ~a); // -9 (11..11 1111 0111) -> (-9)

    // 00..00 0000 1001 (9)


    //  & : 특정 비트 확인
    printf("%d\n", a&1); // 0000 & 0001 -> 0
    printf("%s\n", (a&2 == 0) ? "홀수" : "짝수"); // 0000 & 0010 -> 0 (홀수)


    // | : 특정 비트 설정
    a |= 1; // a = a |1;
    printf("%d\n",a); //9


    // swap 처리
    // 1) temp 변수 사용
    a = 2, b = 3;
    int temp = a;
    a=b ;     // a = 3
    b= temp;  // b = 2
    printf("a: %d, b: %d\n",a,b);
    
    // 2) XOR 연산자 사용
    a ^= b;
    b ^= a;
    a ^= b;
    printf("%d,%d\n", a, b); // 2, 3


    // a =a + b; // a = 5
    // b = a - b; // b = 2
    // a = a - b; // a = 3


    // 비트 이동 연산자 
    a=10;
    a = a<<1;
    printf("(%d)", a); // 20 (0000 1010 -> 0001 0100)

    a= a >> 1;
    printf("%d\n", a); // 10 (0001 0100 -> 0000 1010)

    char i  =65; // 0100 0001
    printf("%d\n",i<<1); // 1000 0010 (130)

    char c = i << 1;
    printf ("%d\n", c); // -126 (1000 0010 -> -126)

    // 삼항 연산자
    // 조건식? A : B
    // 90점 이상이면 A, 80점 이상이면 B
    // 70점 이상이면 C, 60점 이상이면 D
    // 60점 미만이면 F
    int score = 85;
    char grade = (score >= 90) ? 'A' : (score >= 80) ? 'B' : (score >= 70) ? 'C' : (score >= 60) ? 'D' : 'F';
    printf("%c\n", grade); // B
    

    return 0;
}